[
{
		"num":"1",
		"topic":"Logical Deductions",
		"contents":
					[ {"content1":
					"
					<br/>The phenomenon of deriving a conclusion from a single proposition or a set of given propositions, is known as logical deduction. The given propositions are also referred to as the premises.
					<br/><b>Two Inferential Processes of Deduction:</b>
					<br/><b>I. Immediate Deductive Inference:-</b>
					<br/>Here, conclusion is deduced from one of the given propositions, by any of the three ways -conversion, obversion and contraposition.
					<br/><b>1. Conversion:-</b> 
					<br/>The Conversion proceeds with interchanging the subject term and the predicate term i.e. the subject term of the premise becomes the predicate term of the conclusion and the predicate term of the premise becomes the subject of the conclusion. The given proposition is called convertend, whereas the conclusion drawn from it is called its converse.
					<br/><b>Table of Valid Conversions</b>
					<br/>Convertend	Converse
					<br/>A: All S is P
					<br/>Ex. All pins are tops.	I: Some P is S
					<br/>Some tops are pins.
					<br/>E: No S is P.
					<br/>Ex. No fish is whale.	E: No P is S.
					<br/>No whale is fish.
					<br/>I: Some S is P.
					<br/>Ex. Some boys are poets.	I: Some P is S.
					<br/>Some poets are boys.
					<br/>O: Some S is not P.	No valid conversion
					<br/>Note that in a conversion, the quality remains the same and the quantity may change.
					<br/><b>2. Obversion:-</b> 
					<br/>In obversion, we change the quality of the proposition and replace the predicate term by its complement.
					<br/><b>Table of Valid Obversions</b>
					<br/>Obvertend	Obverse
					<br/>A: All birds are mammals.	E: No birds are non-mammals.
					<br/>E: No poets are singers.	A: All poets are non-singers.
					<br/>I: Some nurses are doctors.	O: Some nurses are not non-doctors.
					<br/>O: some politicians are not statesmen.	I: Some politicians are non-statesmen.
					<br/><b>3. Contraposition:-</b> 
					<br/>obtain the contrapositive of a statement, we first replace the subject and predicate terms in the proposition and then exchange both these terms with their complements.
					<br/><b>Table of Valid Contrapositions</b>
					<br/>Proposition	Contrapositive
					<br/>A: All birds are mammals.	A: All non-mammals are non-birds.
					<br/>   I: Some birds are mammals.	I: Some non-mammals are non-birds.
					<br/><b>II. Mediate Deductive Inference (SYLLOGISM):-</b> 
					<br/>First introduced by Aristotle, a Syllogism is a deductive argument in which conclusion has to be drawn from two propositions referred to as the premises.
					<br/><b>Example:-</b>
					<br/>1. All lotus are flowers.
					<br/>2. All flowers are beautiful.
					<br/>3. All lotus are beautiful.
					<br/>Clearly, the propositions 1 and 2 are the premises and the proposition 3, which follows from the first two propositions, is called the conclusion.
					<br/><b>Term :-</b> 
					<br/>Logic, a term is a word or a combination of words, which by itself can be used as a subject or predicate of a proposition.
					<br/>Syllogism is concerned with three terms :
					<br/><b>1.</b> Major Term : It is the predicate of the conclusion and is denoted by P (first letter of 'Predicate').
					<br/><b>2.</b> Minor Term: It is the subject of the conclusion and is denoted by S (first letter of 'Subject').
					<br/><b>3.</b> Middle Term: It is the term common to both the premises and is denoted by M (first letter of 'Middle').
					<br/><b>Example:-</b>
					<br/><b>Premises:-</b>
					<br/>1. All dogs are animals.
					<br/>2. All tigers are dogs.
					<br/><b>Conclusion :-</b>
					<br/>All tigers are animals.
					<br/>Here 'animals' is the predicate of the conclusion and so,.it is the major term. P.
					<br/>'Tigers' is the subject of the conclusion and so, it is the minor term, S.
					<br/>'Dogs' is the term common to both the premises and so, it is the middle term, M.
					<br/><b>Major And Minor Premises:-</b>
					<br/>Of the two premises, the major premise is that in which the middle term is the subject and the minor premise is that in which the middle term is the predicate.
					<br/><b>Rules for Deriving Conclusion:-</b>
					<br/>1.	The conclusion does not contain the middle term.
					<br/>2.	No term can be distributed in the conclusion unless it is distributed in the premises.
					<br/>3.	The middle term (M) should he distributed at least once in the premises. Otherwise, the conclusion cannot follow.
					<br/>4.	No conclusion follows
					<br/>   •	if both the premises are particular
					<br/>   •	if both the premises are negative.
					<br/>   •	if the major premise is particular and the minor premise is negative.
					<br/>5.	If the middle term is distributed twice, the conclusion cannot be universal.
					<br/>6.	If one premise is negative, the conclusion must be negative.
					<br/>7.	If one premise is particular, the conclusion must be particular.
					<br/>8.	If both the premises are affirmative, the conclusion must be affirmative.
					<br/>9.	If both the premises are universal, the conclusion must be universal.
 					<br/>Practice Questions for Logical Deductions
					<br/>In each question below are given two statements followed by two conclusions numbered I and II. You have to take the given two statements to be true even if they seem to be at variance from commonly known facts. Read the conclusion and then decide which of the given conclusions logically follows from the two given statements, disregarding commonly known facts.
					
					"					
					}],
		"examples":
					[ {"example1":
					"
					<b>Statements: No women teacher can play. Some women teachers are athletes.
					<br/>Conclusions:
					<br/>•	Male athletes can play.
					<br/>•	Some athletes can play.
					<br/>Since one premise is negative, the conclusion must be negative. So, neither conclusion follows.
					"},
					{"example2":
					"
					<b>Statements: Some doctors are fools. Some fools are rich.
					<br/>Conclusions:
					<br/>•	Some doctors are rich
					<br/>•	Some rich are doctors.
					
					"}
					],
		"practices":
					[
					{"question1":"
					
					Statements: No women teacher can play. Some women teachers are athletes.
					<br/>Conclusions:
					<br/>•	Male athletes can play.
					<br/>•	Some athletes can play.
					
					", "answer1":"Neither I nor II follows", "option1":"Only conclusion I follows;Only conclusion II follows;Either I or II follows;Neither I nor II follows",
					 "explanation1":
					 "
					 <br/>Since one premise is negative, the conclusion must be negative. So, neither conclusion follows.
					 "},
					{"question2":"
					<br/>Statements: Some doctors are fools. Some fools are rich.
					<br/>Conclusions:
					<br/>•	Some doctors are rich
					<br/>•	Some rich are doctors.
					", "answer2":"Neither I nor II follows", "option2":"Only conclusion I follows;Only conclusion II follows;Either I or II follows;Neither I nor II follows",
					 "explanation2":
					 "
					 <br/>Since both the premises are particular, no definite conclusion follows.
					 "},
					 {"question3":"
					 Statements: All fish are tortoise. No tortoise is a crocodile.
					<br/>Conclusions:
					<br/>•	No crocodile is a fish.
					<br/>•	No fish is a crocodile.
					 ", "answer3":"Both I or II follows", "option3":"Only conclusion I follows;Only conclusion II follows;Both I or II follows;Neither I nor II follows",
					 "explanation3":
					 "
					 <br/>Since both the premises are universal and one premise is negative, the conclusion must be universal negative. Also, the conclusion should not contain the middle term. So, II follows; I is the converse of II and thus it also holds.
					 "},
					 {"question4":"
					 Statements: Some dedicated souls are angels. All social workers are angels.
					<br/>Conclusions:
					<br/>•	Some dedicated souls are social workers.
					<br/>•	Some social workers are dedicated souls.
					 ", "answer4":"Neither I nor II follows", "option4":"Only conclusion I follows;Only conclusion II follows;Both I or II follows;Neither I nor II follows",
					 "explanation4":
					 "
					 <br/>The first premise is an I type proposition. So, the middle term 'angels' forming the predicate is not distributed. The second premise is an A type proposition. So, the middle term 'angels' forming the predicate is not distributed. Since the middle term is not distributed even once in the premises, no definite conclusion follows.
					 "},
					 {"question5":"
					 Statements: Some swords are sharp. All swords are rusty
					<br/>Conclusions:
					<br/>•	Some rusty things are sharp.
					<br/>•	Some rusty things are not sharp.
					 ", "answer5":"Only conclusion I follows", "option5":"Only conclusion I follows;Only conclusion II follows;Both I or II follows;Neither I nor II follows",
					 "explanation5":
					 "
					 <br/>Since one premise is particular, the conclusion must be particular and should not contain the middle term. So, I follows. Since both the premises are affirmative, the conclusion cannot be negative. Thus, II does not follow.
					 "},
					 {"question6":"
					 Statements: All fishes are grey in colour. Some fishes are heavy.
					<br/>Conclusions:
					<br/>•	All heavy fishes are grey in colour.
					<br/>•	All light fishes are not grey in colour.
					 ", "answer6":"Only conclusion I follows", "option6":"Only conclusion I follows;Only conclusion II follows;Both I or II follows;Neither I nor II follows",
					 "explanation6":
					 "
					 <br/>Since one premise is particular, the conclusion must be particular and should not contain the middle term. So, it follows that 'Some heavy things are grey in colour'. I is a cumulative result of this conclusion and the first premise. Thus, only I holds.
					 "},
					 {"question7":"
					 Statements: Some dreams are nights. Some nights are days.
					<br/>Conclusions:
					<br/>All days are either nights or dreams.
					<br/>Some days are nights.
					 ", "answer7":"Only conclusion II follows", "option7":"Only conclusion I follows;Only conclusion II follows;Both I or II follows;Neither I nor II follows",
					 "explanation7":
					 "
					 <br/>Since both the premises are particular, no definite conclusion follows. However, II is the converse of the second premise and thus it holds.
					 "},
					 {"question8":"
					 Statements: All jungles are tigers. Some tigers are horses.
					<br/>Conclusions:
					<br/>•	Some horses are jungles.
					<br/>•	No horse is jungle.
					 ", "answer8":"Either I or II follows", "option8":"Only conclusion I follows;Only conclusion II follows;Either I or II follows;Neither I nor II follows",
					 "explanation8":
					 "
					 <br/>Since the middle term 'tigers' is not distributed even once in the premises, no definite conclusion follows. However, I and II involve only the extreme terms and form a complementary pair. So, either I or II follows.
					 "},
					 {"question9":"
					 Statements: Some tables are TVs. Some TVs are radios.
					<br/>Conclusions:
					<br/>•	Some tables are radios.
					<br/>•	Some radios are tables.
					<br/>•	All radios are TVs.
					<br/>•	All TVs are tables.
					 ", "answer9":"None follows", "option9":"None follows;All follow;Only I and III follow;Only II and IV follow",
					 "explanation9":
					 "
					 <br/>Since both the premises are particular, no definite conclusion follows.
					 "},
					 {"question10":"
					 Statements: All terrorists are guilty. All terrorists are criminals.
					<br/>Conclusions:
					<br/>•	Either all criminals are guilty or all guilty are criminals.
					<br/>•	Some guilty persons are criminals.
					<br/>•	Generally criminals are guilty.
					<br/>•	Crime and guilt go together.
					 ", "answer10":"Only II follows", "option10":"Only I follows;Only I and III follow;Only II follows;Only II and IV follow",
					 "explanation10":
					 "
					 <br/>Since the middle term 'terrorists' is distributed twice in the premises, the conclusion cannot be universal. So, it follows that 'Some guilty persons are criminals'. Thus, II holds.
					 "},
					 {"question11":"
					 Statements: Some bottles are drinks. All drinks are cups.
					<br/>Conclusions:
					<br/>•	Some bottles are cups.
					<br/>•	Some cups are drinks.
					<br/>•	All drinks are bottles.
					<br/>•	All cups are drinks.
					 ", "answer11":"Only I and II follow", "option11":"Only I and II follow;Only II and III follow;Only I and IV follow;Only II and IV follow",
					 "explanation11":
					 "
					 <br/>Since one premise is particular, the conclusion must be particular and should not contain the middle term. So, it follows that 'Some bottles are cups'. Thus, I follows. II is the converse of the second premise and so it also holds
					 "},
					 {"question12":"
					 Statements: Some pictures are frames. Some frames are idols. All idols are curtains.
					<br/>Conclusions:
					<br/>•	Some curtains are pictures.
					<br/>•	Some curtains are frames.
					<br/>•	Some idols are frames.
					 ", "answer12":"Only II and III follow", "option12":"Only I and II follow;Only II and III follow;Only I and III follow;All follow",
					 "explanation12":
					 "
					 <br/>III is the converse of the second premise and so it holds.
					<br/>Some pictures are frames. Some frames are idols.
					<br/>Since both the premises are particular, no definite conclusion follows.
					<br/>Some frames are idols. All idols are curtains.
					<br/>Since one premise is particular, the conclusion must be particular and should not contain the middle term. So, it follows that 'Some frames are curtains'. III is the converse of this conclusion and so it holds.
					 
					 "},
					 {"question13":"
					 Statements: Some blankets are beds. Some pillows are blankets. All beds are pillows.
					<br/>Conclusions:
					<br/>•	Some blankets are pillows.
					<br/>•	Some pillows are beds.
					<br/>•	Some beds are blankets.
					 ", "answer13":"All I, II and III follow", "option13":"Only either I or II follows;Only I and either II or III follow;Only III and either I or II follow;All I, II and III follow",
					 "explanation13":
					 "
					 <br/>I is the converse of the second premise, II is the converse of the third premise and III is the converse of the first premise and as such, all three of them follow.
					 "},
					 {"question14":"
					 Statements: All doors are buses. All buses are leaves. No leaf is a flower.
					<br/>Conclusions:
					<br/>•	No flower is a door.
					<br/>•	No flower is a bus.
					<br/>•	Some leaves are doors.
					<br/>•	Some leaves are buses.
					 ", "answer14":"All follow", "option14":"Only I and II follow;Only II and III follow;Only II, III and IV follow;All follow",
					 "explanation14":
					 "
					 <br/>IV is the converse of the second premise and so it holds.
					<br/>All doors are buses. All buses are leaves.
					<br/>Since both the premises are universal and affirmative, the conclusion must be universal affirmative and should not contain the middle term. So, it follows that 'All doors are leaves'. III is the converse of this conclusion and so it holds.
					<br/>All buses are leaves. No leaf is a flower.
					<br/>Since both the premises are universal and one premise is negative, the conclusion must be universal negative and should not contain the middle term. So, it follows that 'No bus is flower'. II is the converse of this conclusion and so it holds.
					<br/>All doors are buses. No bus is flower.
					<br/>As discussed above, it follows that 'No door is flower'. I is the converse of this conclusion and so it also holds.
					 
					 "},
					 {"question15":"
					 Statements: All oceans are rivers. Some springs are rivers. All wells are springs.
					<br/>Conclusions:
					<br/>•	Some springs are oceans.
					<br/>•	Some wells are rivers.
					<br/>•	Some rivers are oceans.
					<br/>•	No well is river.
					", "answer15":"All follow", "option15":"None follows;Only either I or III, and IV follow;Only either II or IV, and III follow;All follow",
					 "explanation15":
					 "
					 <br/>III is the converse of the first premise and so it holds.
					<br/>All oceans are rivers. Some springs are rivers.
					<br/>Since the middle term 'rivers' is not distributed even once in the premises, no definite conclusion follows.
					<br/>All wells are springs. Some springs are rivers.
					<br/>Since the middle term 'springs' is not distributed even once in the premises, no definite conclusion follows. However, II and IV involve the extreme terms and form a complementary pair. Thus, either II or IV follows.
					 
					 "}					 					
					]
	}
	
]
