[
{
		"num":"1",
		"topic":"Seating Arrangement",
		"contents":
					[ {"content1":
					"
					<br/>Seating arrangement refers to the sitting pattern of any object or person. There are two types of sitting arrangements
					<br/><b>1.	Linear Arrangements:-</b> 
					<br/>In these arrangements objects/person are arranged only on the 'axis' and hence, the position of the subjects assumes importance here in terms of order like first position, second position etc.
					<br/><b>2.	Circular Arrangements:-</b>
					<br/>Questions on circular arrangement involve seating of people around a table or arrangement of things in a circular manner. (For example, different coloured beads strung to form a necklace)
					<br/><b>Important Points:-</b> 
					<br/>1.	In case of people sitting around a table, the table could be of any shape – rectangular, square, circular or any other type.
					<br/>2.	The data given in such sets of questions specify the positions of some or all of the individuals (or things) in the arrangement. The positions are specified through conditions involving specified persons sitting (or not sitting) opposite each other or a particular person sitting to the right or left of another person, etc.
					<br/>3.	Once you read the data, first draw the shape specified in the data and then draw the slots in the seating arrangement.
					<br/>4.	Statements like 'A and B are sitting farthest from each other' or 'A and B sit across the table' imply that A and B sit opposite each other.
					<br/>5.	Unlike Linear arrangement words like 'immediately' and 'directly' do not play role in circular arrangement. So, if its given that C sits to right of B, then it is clear that C must be to the immediate right of B. 
					<br/>6.	Go 'anti-clockwise' if anybody’s right has to be located, and go 'clockwise' if somebody’s left has to be located.
					"					
					}],
		"examples":
					[ {"example1":
					"
					<b>A, P, R, X, S and Z are sitting in a row. S and Z are in the centre. A and P are at the ends. R is sitting to the left of A. Who is to the right of P ?</b>
					<br/>The seating arrangement is as follows: 
					<br/>*		*		*		*		*		*
					<br/>P		X		S		Z		R		A  
					<br/>Therefore, right of P is X.

					"},
					{"example2":
					"
					<b>A, B, C, D and E are sitting on a bench. A is sitting next to B, C is sitting next to D, D is not sitting with E who is on the left end of the bench. C is on the second position from the right. A is to the right of B and E. A and C are sitting together. In which position A is sitting ?</b>
					<br/>*		*		*		*		*
					<br/>E		B		A		C		D
					<br/>Therefore, A is sitting in between B and C.
					
					"}
					],
		"practices":
					[
					{"question1":"A, P, R, X, S and Z are sitting in a row. S and Z are in the centre. A and P are at the ends. R is sitting to the left of A. Who is to the right of P ?", "answer1":"X", "option1":"A;X;S;Z",
					 "explanation1":
					 "
					<br/>The seating arrangement is as follows: 
					<br/>*		*		*		*		*		*
					<br/>P		X		S		Z		R		A  
					<br/>Therefore, right of P is X.
					 "},
					{"question2":"A, B, C, D and E are sitting on a bench. A is sitting next to B, C is sitting next to D, D is not sitting with E who is on the left end of the bench. C is on the second position from the right. A is to the right of B and E. A and C are sitting together. In which position A is sitting ?", "answer2":"Between B and C", "option2":"Between B and D;Between B and C;Between E and D;Between C and E",
					 "explanation2":
					 "
					<br/>*		*		*		*		*
					<br/>E		B		A		C		D
					<br/>Therefore, A is sitting in between B and C.
					 "},
					 {"question3":"
					 P, Q, R, S, T, U, V and W are sitting round the circle and are facing the centre:
					<br/>1.	P is second to the right of T who is the neighbour of R and V.
					<br/>2.	S is not the neighbour of P.
					<br/>3.	V is the neighbour of U.
					<br/>4.	Q is not between S and W. W is not between U and S.
					<br/>Which two of the following are not neighbors ?
					 ", "answer3":"RV", "option3":"RV;UV;PV;QW",
					 "explanation3":
					 "
					<br/>
					<br/> 	      Q
					<br/>         - 
					<br/>   W-        -P
					<br/>             
					<br/>  S-           _R
					<br/>  
					<br/>    U-       _T
					<br/>        _
					<br/>        V
  
					 "},
					 {"question4":"
					 P, Q, R, S, T, U, V and W are sitting round the circle and are facing the centre:
					<br/>1.	P is second to the right of T who is the neighbour of R and V.
					<br/>2.	S is not the neighbour of P.
					<br/>3.	V is the neighbour of U.
					<br/>4.	Q is not between S and W. W is not between U and S.
					<br/>Which one is immediate right to the V ?
					 ", "answer4":"T", "option4":"P;U;R;T",
					 "explanation4":
					 "
					<br/>
					<br/> 	      Q
					<br/>         - 
					<br/>   W-        -P
					<br/>             
					<br/>  S-           _R
					<br/>  
					<br/>    U-       _T
					<br/>        _
					<br/>        V
					 "},
					 {"question5":"Five girls are sitting on a bench to be photographed. Seema is to the left of Rani and to the right of Bindu. Mary is to the right of Rani. Reeta is between Rani and Mary. Who is sitting immediate right to Reeta ?", "answer5":"Marry", "option5":"Bindu;Rani;Marry;Seema",
					 "explanation5":
					 "
					<br/>  *		*		*		*		*
					<br/>Bindu	  Seema	   Rani    Reeta   Marry					 
					<br/>Mary is sitting immediate right to Reeta.
					 "},
					 {"question6":"Five girls are sitting on a bench to be photographed. Seema is to the left of Rani and to the right of Bindu. Mary is to the right of Rani. Reeta is between Rani and Mary. Who is second from the left in photograph ? ", "answer6":"Seema", "option6":"Seema;Marry;Reeta;Bindu",
					 "explanation6":
					 "
					<br/>  *		*		*		*		*
					<br/>Bindu	  Seema	   Rani    Reeta   Marry
					<br/>Seema is sitting second from the left in photograph.
					 "},
					 {"question7":"Six friends are sitting in a circle and are facing the centre of the circle. Deepa is between Prakash and Pankaj. Priti is between Mukesh and Lalit. Prakash and Mukesh are opposite to each other. Who is sitting opposite to Prakash ?", "answer7":"Mukesh", "option7":"Mukesh;Deepa;Pankaj;Lalit",
					 "explanation7":
					 "
					<br/>
					<br/> 	        Prakash
					<br/>             - 
					<br/>   Lalit-           -Deepa
					<br/>             
					<br/>	Priti			_Pankaj
					<br/>  
					<br/>         _Mukesh
					 <br/>Hence, Mukesh is sitting opposite to Prakash.
					 "},
					 {"question8":"Six friends are sitting in a circle and are facing the centre of the circle. Deepa is between Prakash and Pankaj. Priti is between Mukesh and Lalit. Prakash and Mukesh are opposite to each other. Who is sitting opposite to Priti ?", "answer8":"Deepa", "option8":"Prakash;Deepa;Pankaj;Lalit",
					 "explanation8":
					 "
					<br/>
					<br/> 	        Prakash
					<br/>             - 
					<br/>   Lalit-           -Deepa
					<br/>             
					<br/>	Priti			_Pankaj
					<br/>  
					<br/>         _Mukesh					 
					 <br/>Hence, Deepa is sitting opposite to Priti.
					 "},
					 {"question9":"Six friends P, Q, R, S, T and U are sitting around the hexagonal table each at one corner and are facing the centre of the hexagonal. P is second to the left of U. Q is neighbour of R and S. T is second to the left of S. Who is the fourth person to the left of Q ?", "answer9":"P", "option9":"P;R;S;U",
					 "explanation9":
					 "
					<br/>             P
					<br/>            / \
					<br/>           T   R
					<br/>           |   |
					<br/>           U   Q
					<br/>            \ /
					<br/>             S
					<br/>P is the fourth person to the left of Q.					
					"},
					 {"question10":"Six friends P, Q, R, S, T and U are sitting around the hexagonal table each at one corner and are facing the centre of the hexagonal. P is second to the left of U. Q is neighbour of R and S. T is second to the left of S. Which of the following are the neighbors of P ?", "answer10":"T and R", "option10":"U and P;T and R;U and R;Data inadequate",
					 "explanation10":
					 "
					<br/>             P
					<br/>            / \
					<br/>           T   R
					<br/>           |   |
					<br/>           U   Q
					<br/>            \ /
					<br/>             S					 
					<br/>T and R are the neighbours of P.
					 "},
					 {"question11":"In a class there are seven students (including boys and girls) A, B, C, D, E, F and G. They sit on three benches I, II and III. Such that at least two students on each bench and at least one girl on each bench. C who is a girl student, does not sit with A, E and D. F the boy student sits with only B. A sits on the bench I with his best friends. G sits on the bench III. E is the brother of C. How many girls are there out of these 7 students ? ", "answer11":"3 or 4", "option11":"3;4;3 or 4;Data Inadequate",
					 "explanation11":
					 "					 
					 <br/>&#x22FF; Boy  and &#x25CE; Girl
					 <br/>
					 <br/>Batch I     &#x22FF;A   &#x22FF;E  &#x25CE;D
					 <br/>					 
					 <br/>Batch II    &#x22FF;F   &#x25CE;B
					 <br/>					 
					 <br/>Batch III   &#x22FF;G   &#x25CE;C
					 <br/>
					 <br/>The number of girls is either 3 or 4.
					 "},
					 {"question12":"In a class there are seven students (including boys and girls) A, B, C, D, E, F and G. They sit on three benches I, II and III. Such that at least two students on each bench and at least one girl on each bench. C who is a girl student, does not sit with A, E and D. F the boy student sits with only B. A sits on the bench I with his best friends. G sits on the bench III. E is the brother of C. Which of the following is the group of girls ? ", "answer12":"BCD", "option12":"BAC;BFC;BCD;CDF",
					 "explanation12":
					 "
					 <br/>&#x22FF; Boy  and &#x25CE; Girl
					 <br/>
					 <br/>Batch I     &#x22FF;A   &#x22FF;E  &#x25CE;D
					 <br/>					 
					 <br/>Batch II    &#x22FF;F   &#x25CE;B
					 <br/>					 
					 <br/>Batch III   &#x22FF;G   &#x25CE;C
					 <br/>
					 <br/>BCD are the group of girls.
					 "},
					 {"question13":"In a class there are seven students (including boys and girls) A, B, C, D, E, F and G. They sit on three benches I, II and III. Such that at least two students on each bench and at least one girl on each bench. C who is a girl student, does not sit with A, E and D. F the boy student sits with only B. A sits on the bench I with his best friends. G sits on the bench III. E is the brother of C. Who sits with C ?", "answer13":"G", "option13":"B;D;G;E",
					 "explanation13":
					 "
					 <br/>&#x22FF; Boy  and &#x25CE; Girl
					 <br/>
					 <br/>Batch I     &#x22FF;A   &#x22FF;E  &#x25CE;D
					 <br/>					 
					 <br/>Batch II    &#x22FF;F   &#x25CE;B
					 <br/>					 
					 <br/>Batch III   &#x22FF;G   &#x25CE;C
					 <br/>
					 <br/>G sits with C.
					 "},
					 {"question14":"Six girls are sitting in a circle facing to the center of the circle. They are P, Q, R, S, T and V. T is not between Q and S but some other one. P is next to the left of V. R is 4th to the right of P. Which of the following statement is not true ?", "answer14":"R is second to the left of T", "option14":"R is second to the left of T;T is just next to the right of V;S is just next to the right to R;P is second to the right of R",
					 "explanation14":
					 "
					<br/>
					<br/>     V -     -P
					<br/>   
					<br/>   T-            -Q/S
					<br/>
					<br/>      -      -R
					<br/>     S/Q

					 "},
					 {"question15":"Six girls are sitting in a circle facing to the center of the circle. They are P, Q, R, S, T and V. T is not between Q and S but some other one. P is next to the left of V. R is 4th to the right of P.What is the position of T ? ", "answer15":"To the immediate right of V", "option15":"Just next to the right of Q;Second to the left of P;Between Q and R;To the immediate right of V",
					 "explanation15":
					 "
					<br/>
					<br/>     V -     -P
					<br/>   
					<br/>   T-            -Q/S
					<br/>
					<br/>      -      -R
					<br/>     S/Q

					 "}
					 ]
	}
	
]
