[
{
		"num":"1",
		"topic":"Direction Sense",
		"contents":
					[ {"content1":
					"
					<br/>The questions on direction sense typically involve a person moving certain distances in specified directions. Then, the student is asked to find out the distances between the initial and the final points. The easier way of solving these problems is to draw a diagram as you read the information given in the problem and ensure that the diagram reflects all the information given the problem.
					<br/>To solve these types of problems, the student should be aware of directions. The student should also recognize the left and right of a person walking in  a particular direction. The following diagram shows all the directions and Left (L) and Right (R) of a person walking in that direction.
					<br/>				North
					<br/>	North-West     	   North-East
					<br/>		   .      |   .
					<br/>			 .    |  . 
					<br/>			    . |. 
					<br/>	West----------|----------East
					<br/>			      |
					<br/>			      |
					<br/>			      |
					<br/>			    South
					<br/><b>Important Points:-</b>
					<br/>  *	The distance from a particular point after travelling a distance of x meters in the horizontal direction and a distance of y meters in the vertical direction is equal to √(x<sup>2</sup>+ y<sup>2</sup> )
					<br/>  *	In common usage, North South direction is referred to 'Vertical' Direction and the East West direction is referred to as the 'Horizontal' direction.


					
					"					
					}],
		"examples":
					[ {"example1":
					"
					<b>A man walks 5 km toward south and then turns to the right. After walking 3 km he turns to the left and walks 5 km. Now in which direction is he from the starting place?</b>
					<br/>                    
					<br/>				   A
					<br/>				   |
					<br/>				   |
					<br/>			  3KM  |
					<br/>		    C------B
					<br/>			|
					<br/>			|5KM
					<br/>			|
					<br/>			D
					<br/>Hence required direction is South-West.
					"},
					{"example2":
					"
					<b>A man is facing west. He turns 45 degree in the clockwise direction and then another 180 degree in the same direction and then 270 degree in the anticlockwise direction. Find which direction he is facing now ?</b>
					<br/>Explain. The man firstly faces the direction OA. On moving 45 degree clockwise[Please check carefully always if clockwise or anticlockwise], he faces the direction OB.
					<br/>Now again he moved 180 degree clockwise, now he will be facing OC. From here he moved 270 degree anticlockwise, Finally he is facing OD, which is South west					
					"}
					],
		"practices":
					[
					{"question1":"One morning Udai and Vishal were talking to each other face to face at a crossing. If Vishal's shadow was exactly to the left of Udai, which direction was Udai facing?", "answer1":"North", "option1":"East;West;North;South",
					 "explanation1":
					 "
					 <br/>      Udai|								N
					 <br/>			|								|
					 <br/>			|								|
					 <br/>			- ---->Visal's shadow    W------|-------S
					 <br/>			^								|
					 <br/>			|								|
					 <br/>			|								|
					 <br/>			|								S
					 <br/>	   Visal|
					 <br/>
					 "},
					{"question2":"Y is in the East of X which is in the North of Z. If P is in the South of Z, then in which direction of Y, is P?", "answer2":"None of these", "option2":"North;South;South-East;None of these",
					 "explanation2":
					 "
					 <br/> X--------Y
					 <br/> |      .
					 <br/> |    .
					 <br/> Z  .
					 <br/> | .
					 <br/> |.
					 <br/> P
					 <br/>P is in South-West of Y.
					 "},
					 {"question3":"A man walks 5 km toward south and then turns to the right. After walking 3 km he turns to the left and walks 5 km. Now in which direction is he from the starting place?", "answer3":"South-West", "option3":"West;South;North-East;South-West",
					 "explanation3":
					 "
					<br/>                    
					<br/>				   A
					<br/>				   |
					<br/>				   |
					<br/>			  3KM  |
					<br/>		    C------B
					<br/>			|
					<br/>			|5KM
					<br/>			|
					<br/>			D
					<br/>Hence required direction is South-West.
					"},
					 {"question4":"A man is facing west. He turns 45 degree in the clockwise direction and then another 180 degree in the same direction and then 270 degree in the anti-clockwise direction. Find which direction he is facing now ?", "answer4":"South-West", "option4":"South-West;South;South-East;West",
					 "explanation4":
					 "
					 <br/>Explanation: The man firstly faces the direction OA. On moving 45 degree clockwise[Please check carefully always if clockwise or anticlockwise], he faces the direction OB.
					 <br/>Now again he moved 180 degree clockwise, now he will be facing OC. From here he moved 270 degree anticlockwise, Finally he is facing OD, which is South west
					 
					 "},
					 {"question5":"A man is facing north. He turns 45 degree in the clockwise direction and then another 180 degree in the same direction and then 45 degree in the anti-clockwise direction. Find which direction he is facing now?", "answer5":"East", "option5":"North;West;South;East",
					 "explanation5":
					 "
					<br/>       N
					<br/>		|        .
					<br/>		|      . 
					<br/>		|    .
					<br/>		|  .
					<br/>		|.
					<br/>W-------------------E
					<br/>	  . |
					<br/>	 .  | 
					<br/>	.   |
					<br/> .     |
					<br/>       S 
					 <br/>The man firstly faces the direction OA. On moving 45 degree clockwise, he faces the direction OB.
					<br/>Now again he moved 180 degree clockwise, now he will be facing OC. From here he moved 45 degree anticlockwise, Finally he is facing OD, which is South direction.
					 
					 "},
					 {"question6":"A dog runs 20 meter towards East and turns Right, runs 10 metre and turns to right, runs 9 metre and again turns to left, runs 5 metre and then turns to left, runs 12 metre and finally turns to left and runs 6 meter. Now which direction dog is facing ?", "answer6":"North", "option6":"East;North;South;West",
					 "explanation6":
					 "
					 <br/>     A-------------B
					 <br/>			   	     |
					 <br/>				     |
					 <br/>				     |
					 <br/>	       D---------C
					 <br/>	       |             G
					 <br/>	       |             |
					 <br/>	       |             |
					 <br/>	       E-------------F		
					 <br/>Now dog is facing North.	
					 "},
					 {"question7":"I am facing South. I turn right and walk 20 meter. Then I turn right again and walk 10 meter. Then I turn left and walk 10 meter and then turning right walk 20 meter. Then I turn right again and walk 60 meter. In which direction am I from the starting point ?", "answer7":"North-East", "option7":"North-East;North-West;North;West",
					 "explanation7":
					 "
					 <br/>Final direction will be north-east with reference to the starting position.
					 "},
					 {"question8":"From his house, Lokesh went 15 kms to the North. Then he turned West and covered 10 kms. Then he turned South and covered 5 kms. Finally, turning to East, he covered 10 kms. In which direction is he from his house ?", "answer8":"North", "option8":"East;North;West;South",
					 "explanation8":
					 "
					 <br/>
					 "},
					 {"question9":"K is 40 m South-West of L. If M is 40 m South-East of L, then M is in which direction of K?", "answer9":"", "option9":"East;West;North-East;South",
					 "explanation9":
					 "
					 <br/>Hence M is in the East of K.
					 "},
					 {"question10":"A man walks 2 km towards North. Then he turns to East and walks 10 km. After this he turns to North and walks 3 km. Again he turns towards East and walks 2 km. How far is he from the starting point?", "answer10":"13 km", "option10":"10 km;12 km;13 km;15 km",
					 "explanation10":
					 "
					 <br/>Pending
					 "},
					 {"question11":"The length and breadth of a room are 8 m and 6 m respectively. A cat runs along all the four walls and finally along a diagonal order to catch a rat. How much total distance is covered by the cat?", "answer11":"38", "option11":"10;14;38;48",
					 "explanation11":
					 "
					 <br/>Pending
					 "},
					 {"question12":"After walking 6 km, I turned to the right and then walked 2 km. After then I turned to the left and walked 10 km. In the end, I was moving towards the North. From which direction did I start my journey?", "answer12":"South", "option12":"North;South;East;West",
					 "explanation12":
					 "
					 <br/>The journey was started from the South.
					 "},
					 {"question13":"
					 
					 <br/>Dev, Kumar, Nilesh, Ankur and Pintu are standing facing to the North in a playground such as given below:
					<br/>1.	Kumar is at 40 m to the right of Ankur.
					<br/>2.	Dev is are 60 m in the south of Kumar.
					<br/>3.	Nilesh is at a distance of 25 m in the west of Ankur.
					<br/>4.	Pintu is at a distance of 90 m in the North of Dev.
					<br/>Which one is in the North-East of the person who is to the left of Kumar?
					 
					 ", "answer13":"Pintu", "option13":"Dev;Nilesh;Ankur;Pintu",
					 "explanation13":
					 "
					 <br/>Ankur is in the left of Kumar. Hence Pintu is in North-East of Ankur.
					 "},
					 {"question14":"Village Q is to the North of the village P. The village R is in the East of Village Q. The village S is to the left of the village P. In which direction is the village S with respect to village R?", "answer14":"South-West", "option14":"West;South-West;South;North-West",
					 "explanation14":
					 "
					 <br/>S is to the South-West of R.
					 "},
					 {"question15":"X started to walk straight towards south. After walking 5 m he turned to the left and walked 3 m. After this he turned to the right and walked 5 m Now to which direction X is facing?", "answer15":"South", "option15":"North-East;South;North;South-West",
					 "explanation15":
					 "
					 <br/>Hence X will face in the end towards South.
					 "}					
					 ]
	}
	
]
